app/controllers/tasks_controller.rb

SELECT `tasks`.* FROM `tasks`
---
  def index
    @task = Task.new
    @tasks = Task.all

INSERT INTO `tasks` (`created_at`, `task`, `updated_at`) VALUES ('2012-10-19 20:49:56', 'hello', '2012-10-19 20:49:56')
---
  def create
    #render :text => params.inspect

    Task.create params[:task]

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1
---
  def edit
    @task = Task.find params[:id]

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 2 LIMIT 1
UPDATE `tasks` SET `task` = 'hello hi', `updated_at` = '2012-10-19 21:19:17' WHERE `tasks`.`id` = 2
---
    task = Task.find params[:id]
    if task.update_attributes params[:task]

DELETE FROM `tasks` WHERE `tasks`.`id` = 1
---
  def destroy
     Task.destroy params[:id]